[
    {
        "name": "Bourgeoisie Revolution!",
        "text": "The Traditional Feudal System crumbles before the new rising bourgeoisie class as industrial revolution continues. Subsequently, bourgeoisies and proletariats revolted against the traditional system, how does the revolution happen?",
        "choices": [
            {
                "text": "The Revolution has failed.",
                "uniques": [
                "Comment [The revolution is dead. The government of nobilities continue their ruling, long term negative impact for any attempt at reforms, short term negative effects on economy. But 'Noble Army' strength are increased by a third permanently.]",

                "Remove [Revolution] and refund [100]% of its cost",
                "Gain a free [Failed Bourgeoisie Revolution] [in capital]",
                "Free [Great General] appears",
                "[2] free [Royal Cuirassier] units appear"]
            }
            {
                "text": "Peaceful Transition.",
                "uniques": [
                "Comment [Long term societal divide hinders futher policy and economic development. But the revolution have its main goal achieved]",

                "Free Social Policy",
                "Gain a free [Peaceful Bourgeoisie Revolution] [in capital]",
                "Free [Revolutionaries] appears"]
            },
            {
                "text": "Both negotiations and conflicts are happening...",
                "uniques": [
                "Comment [The revolution...is chaotic. Some cities have peacefully transitioned their power to the new ruling class, while some starts to infight violently. Rebel unit will spawn for 8 turns, but there are overall less side effects. All Revolutionaries gain some basic promotions and the 'Standing Army' gains 5% strength bonus permanently.]",
                
                "Gain a free [Chaotic Bourgeoisie Revolution] [in capital]",
                "[2] free [Revolutionaries] units appear"]
            },
            {
                "text": "Clean the parasites!",
                "uniques": [
                "Comment [The revolution violently shaked the basis of our society, but our society is able to leap toward progressiveness! Rebel unit will spawn for 24 turns and the economy will suffer for a while, but the will of the revolution is well preserved and people are more accepting to societal changes. All Revolutionaries gain many promotions and the 'Standing Army' gains 10% strength bonus permanently.]",

                "Gain a free [Violent Bourgeoisie Revolution] [in capital]",
                "[3] free [Revolutionaries] units appear"]
            }
        ]
    }
]