[
  // Each entry is a tutorial, but the tutorial may be spread over separate paragraphs.

  {
    "name": "Introduction",
    "steps": [
      "Welcome to Emperors and Dieties\nThis is a ruleset mod that focuses on actually building the civ from the ground up. It is less gamey to a certain extend, perhaps more realistic and with more options? There are SERVERAL SINIFICANT GAMEPLAY changes from the original civ 5, so you are advised to look through tutorial at least once.\nRemeber to send feedback to the developer in official discord thread! You may notice the icons are different, props to bucketeer for making these icons."
    ]
  },
  {
    "name": "New Game",
    "civilopediaText": [
      {"text":"Settling near fresh water now gives +2 Food to your cities and grants access to more river buildings afterward. There are also more changes toward the resources and tile improvements, overall theres much more rewards in development. But a crucial thing is that luxury resources dont reward happiness anymore.\nThey rewards large amount of stats to maintain your future empires instead."}
    ]
  }
  {
    "name": "Happiness",
    "steps": [
      "As cities grow in size and influence, you have to deal with a happiness mechanic which repersents your ability to rule your empire.\nAs your cities grow in population you’ll find that it is more and more difficult to keep your empire well governed."    ,
      "If your empire’s happiness ever goes below zero the population growth rate of your cities will suffer.\nIf your empire becomes severely out of control (as indicated by the smiley-face icon at the top of the interface)\n  your armies will have a big penalty slapped on to their overall combat effectiveness."
    ]
  },
  {
    "name": "Unhappiness",
    "steps": [
      "It seems that your citizens are unhappy!\nWhile unhappy, your civilization will suffer many detrimental effects, increasing in severity as unhappiness gets higher.",
      "Unhappiness has two main causes: Population and cities.\n  Each city causes 3 unhappiness, and each population, 1",
      "There are 2 main ways to combat unhappiness:\n  by building happiness buildings for your population\n  or by adopting appriate policies/beliefs in your religion."
    ]
  },
  {
    "name": "Luxury Resource",
    "steps": [
      "Luxury resources within your domain and with their specific improvement are connected to your trade network.\nEach unique Luxury resource tile provides a lot of gold and other stats, but extra resources of the same type don't add anything, so use them for trading with other civilizations to activate we love king day more often!"
    ]
  },
  {
    "name": "Strategic Resource",
    "steps": [
      "Strategic resources within your domain and with their specific improvement are connected to your trade network.\nStrategic resources allow you to train units and construct buildings that require those specific resources, for example the Horseman requires Horses.",
	    "Unlike Luxury Resources, each Strategic Resource on the map provides more than one of that resource.\nThe top bar keeps count of how many unused strategic resources you own.\nA full drilldown of resources is available in the Resources tab in the Overview screen.",
      "You will also be able to produce Strategic Resources if you have certain bonus resources and corresponding buildings.n/Strategic Resources can also be made into more advanced ones to produce powerful units."
    ]
  },
]
